Revit 2024 API
ParameterTypeId.AnalyticalNodeConnectionStatus Property
 "Connection Status"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId AnalyticalNodeConnectionStatus { get; }
Visual Basic
Public Shared ReadOnly Property AnalyticalNodeConnectionStatus As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ AnalyticalNodeConnectionStatus {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace